<?php

namespace Database\Seeders;

use Hash;
use App\Models\blog;
use Illuminate\Database\Seeder;

class blogTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {


         for ($i=1; $i <=10 ; $i++)
         {
            /////////////// blog
            $add=new blog;
            $add->title='عنوان الموضوع'.($i+1);
            $add->desc='<p>
                                    مرحبًا بكم في أفضل مورد على الإنترنت لتعلم نُشر هذا البرنامج في أبريل 2019 ،
                                    وهو جديد تمامًا ويغطي الأحدث في . تتبع هذه الدورة نفس منهج بالضبط الذي يتبعه
                                    طلاب المعسكر التدريبي الشخصي في المملكة ، حيث استمر الطلاب في الحصول
                                    على وظائف في أماكن مثل هذه هي دورة الأكثر مصقولة عبر الإنترنت ، وهي الدورة
                                    التدريبية الوحيدة التي تستند إلى منهج الذي تم تجربته واختباره في الفصل
                                    الدراسي.

                                </p>

                                <p>
                                    تقوم هذه الدورة التدريبية بتكوين مفاهيم واحدة في كل مرة ، مما يعزز كل موضوع
                                    جديد بممارسة أو مشروع مصمم بخبرة لاختبار معرفتك. ويشمل مجموعة كبيرة من
                                    التدريبات والمشاريع والألعاب الجميلة التي نقوم بإنشائها معًا من الصفر.
                                    أحيانًا نخلط بين الأشياء ونمنحك تطبيق مكسور ونطلب منك إصلاحه أو تحسين الكود.
                                    تحقق من الفيديو الترويجي لرؤية اثنين من التدريبات بالطبع. تتوج الدورة
                                    التدريبية بمشروع كابستون الضخم ، وهو أكبر مشروع قمت بإنشائه في أي دورة
                                    تدريبية على الإنترنت. أنا متحمس للغاية حيال ذلك.
                                </p>';
            $add->img='Forentend/img/blog.jpg';
            $add->save();

         }






    }
}
