<?php

namespace Database\Seeders;

use Hash;
use App\Models\Course;
use Illuminate\Database\Seeder;

class CourseTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {



          /////////////// Course
            $add=new Course;
            $add->department_id=1;
            $add->title='مقدمة فى التسويق عبر وسائل التواصل الاجتماعى1';
            $add->desc='<p>
                                    مرحبًا بكم في أفضل مورد على الإنترنت لتعلم نُشر هذا البرنامج في أبريل 2019 ،
                                    وهو جديد تمامًا ويغطي الأحدث في . تتبع هذه الدورة نفس منهج بالضبط الذي يتبعه
                                    طلاب المعسكر التدريبي الشخصي في المملكة ، حيث استمر الطلاب في الحصول
                                    على وظائف في أماكن مثل هذه هي دورة الأكثر مصقولة عبر الإنترنت ، وهي الدورة
                                    التدريبية الوحيدة التي تستند إلى منهج الذي تم تجربته واختباره في الفصل
                                    الدراسي.

                                </p>

                                <p>
                                    تقوم هذه الدورة التدريبية بتكوين مفاهيم واحدة في كل مرة ، مما يعزز كل موضوع
                                    جديد بممارسة أو مشروع مصمم بخبرة لاختبار معرفتك. ويشمل مجموعة كبيرة من
                                    التدريبات والمشاريع والألعاب الجميلة التي نقوم بإنشائها معًا من الصفر.
                                    أحيانًا نخلط بين الأشياء ونمنحك تطبيق مكسور ونطلب منك إصلاحه أو تحسين الكود.
                                    تحقق من الفيديو الترويجي لرؤية اثنين من التدريبات بالطبع. تتوج الدورة
                                    التدريبية بمشروع كابستون الضخم ، وهو أكبر مشروع قمت بإنشائه في أي دورة
                                    تدريبية على الإنترنت. أنا متحمس للغاية حيال ذلك.
                                </p>';
            $add->what_you_will_learn='<h4 class="mb-3">ما سوف تتعلم فى هذه الدورة</h4>

            <div class="row courseitems">
                                        <div class="col">
                                            <ul class="list-unstyled p-0">
                                                <li>التسويق الالكترونى</li>
                                                <li>صفحات ومجموعات الفيس بوك</li>
                                                <li>منصات تويتر ولينكد ان</li>

                                            </ul>
                                        </div>
                                        <div class="col">
                                            <ul class="list-unstyled p-0">
                                                <li>منصات سناب شات</li>
                                                <li>الاعلانات المدفوعة والمميزة</li>
                                                <li>الوصول للجمهور المستهدف</li>
                                            </ul>
                                        </div>
                                    </div>';
            $add->img='Courses/c1.jpg';
            $add->price=rand(1,10000);
            $add->registered_users_count=6;
            $add->lang='العربية';
            $add->duration=10;
            $add->certificate=1;
            $add->save();


             /////////////// Course
            $add=new Course;
            $add->department_id=1;
            $add->title='مقدمة فى التسويق عبر وسائل التواصل الاجتماعى2';
            $add->desc='<p>
                                    مرحبًا بكم في أفضل مورد على الإنترنت لتعلم نُشر هذا البرنامج في أبريل 2019 ،
                                    وهو جديد تمامًا ويغطي الأحدث في . تتبع هذه الدورة نفس منهج بالضبط الذي يتبعه
                                    طلاب المعسكر التدريبي الشخصي في المملكة ، حيث استمر الطلاب في الحصول
                                    على وظائف في أماكن مثل هذه هي دورة الأكثر مصقولة عبر الإنترنت ، وهي الدورة
                                    التدريبية الوحيدة التي تستند إلى منهج الذي تم تجربته واختباره في الفصل
                                    الدراسي.

                                </p>

                                <p>
                                    تقوم هذه الدورة التدريبية بتكوين مفاهيم واحدة في كل مرة ، مما يعزز كل موضوع
                                    جديد بممارسة أو مشروع مصمم بخبرة لاختبار معرفتك. ويشمل مجموعة كبيرة من
                                    التدريبات والمشاريع والألعاب الجميلة التي نقوم بإنشائها معًا من الصفر.
                                    أحيانًا نخلط بين الأشياء ونمنحك تطبيق مكسور ونطلب منك إصلاحه أو تحسين الكود.
                                    تحقق من الفيديو الترويجي لرؤية اثنين من التدريبات بالطبع. تتوج الدورة
                                    التدريبية بمشروع كابستون الضخم ، وهو أكبر مشروع قمت بإنشائه في أي دورة
                                    تدريبية على الإنترنت. أنا متحمس للغاية حيال ذلك.
                                </p>';
            $add->what_you_will_learn='<h4 class="mb-3">ما سوف تتعلم فى هذه الدورة</h4>

            <div class="row courseitems">
                                        <div class="col">
                                            <ul class="list-unstyled p-0">
                                                <li>التسويق الالكترونى</li>
                                                <li>صفحات ومجموعات الفيس بوك</li>
                                                <li>منصات تويتر ولينكد ان</li>

                                            </ul>
                                        </div>
                                        <div class="col">
                                            <ul class="list-unstyled p-0">
                                                <li>منصات سناب شات</li>
                                                <li>الاعلانات المدفوعة والمميزة</li>
                                                <li>الوصول للجمهور المستهدف</li>
                                            </ul>
                                        </div>
                                    </div>';
            $add->img='Courses/c2.jpg';
            $add->price=rand(1,10000);
            $add->registered_users_count=20;
            $add->lang='الإسبانية';
            $add->duration=13;
            $add->certificate=0;
            $add->save();


             /////////////// Course
            $add=new Course;
            $add->department_id=2;
            $add->title='مقدمة فى التسويق عبر وسائل التواصل الاجتماعى3';
            $add->desc='<p>
                                    مرحبًا بكم في أفضل مورد على الإنترنت لتعلم نُشر هذا البرنامج في أبريل 2019 ،
                                    وهو جديد تمامًا ويغطي الأحدث في . تتبع هذه الدورة نفس منهج بالضبط الذي يتبعه
                                    طلاب المعسكر التدريبي الشخصي في المملكة ، حيث استمر الطلاب في الحصول
                                    على وظائف في أماكن مثل هذه هي دورة الأكثر مصقولة عبر الإنترنت ، وهي الدورة
                                    التدريبية الوحيدة التي تستند إلى منهج الذي تم تجربته واختباره في الفصل
                                    الدراسي.

                                </p>

                                <p>
                                    تقوم هذه الدورة التدريبية بتكوين مفاهيم واحدة في كل مرة ، مما يعزز كل موضوع
                                    جديد بممارسة أو مشروع مصمم بخبرة لاختبار معرفتك. ويشمل مجموعة كبيرة من
                                    التدريبات والمشاريع والألعاب الجميلة التي نقوم بإنشائها معًا من الصفر.
                                    أحيانًا نخلط بين الأشياء ونمنحك تطبيق مكسور ونطلب منك إصلاحه أو تحسين الكود.
                                    تحقق من الفيديو الترويجي لرؤية اثنين من التدريبات بالطبع. تتوج الدورة
                                    التدريبية بمشروع كابستون الضخم ، وهو أكبر مشروع قمت بإنشائه في أي دورة
                                    تدريبية على الإنترنت. أنا متحمس للغاية حيال ذلك.
                                </p>';
            $add->what_you_will_learn='<h4 class="mb-3">ما سوف تتعلم فى هذه الدورة</h4>

            <div class="row courseitems">
                                        <div class="col">
                                            <ul class="list-unstyled p-0">
                                                <li>التسويق الالكترونى</li>
                                                <li>صفحات ومجموعات الفيس بوك</li>
                                                <li>منصات تويتر ولينكد ان</li>

                                            </ul>
                                        </div>
                                        <div class="col">
                                            <ul class="list-unstyled p-0">
                                                <li>منصات سناب شات</li>
                                                <li>الاعلانات المدفوعة والمميزة</li>
                                                <li>الوصول للجمهور المستهدف</li>
                                            </ul>
                                        </div>
                                    </div>';
            $add->img='Courses/c3.jpg';
            $add->price=rand(1,10000);
            $add->registered_users_count=3;
            $add->lang='الإنجليزية';
            $add->duration=8;
            $add->certificate=1;
            $add->save();


             /////////////// Course
            $add=new Course;
            $add->department_id=2;
            $add->title='مقدمة فى التسويق عبر وسائل التواصل الاجتماعى4';
            $add->desc='<p>
                                    مرحبًا بكم في أفضل مورد على الإنترنت لتعلم نُشر هذا البرنامج في أبريل 2019 ،
                                    وهو جديد تمامًا ويغطي الأحدث في . تتبع هذه الدورة نفس منهج بالضبط الذي يتبعه
                                    طلاب المعسكر التدريبي الشخصي في المملكة ، حيث استمر الطلاب في الحصول
                                    على وظائف في أماكن مثل هذه هي دورة الأكثر مصقولة عبر الإنترنت ، وهي الدورة
                                    التدريبية الوحيدة التي تستند إلى منهج الذي تم تجربته واختباره في الفصل
                                    الدراسي.

                                </p>

                                <p>
                                    تقوم هذه الدورة التدريبية بتكوين مفاهيم واحدة في كل مرة ، مما يعزز كل موضوع
                                    جديد بممارسة أو مشروع مصمم بخبرة لاختبار معرفتك. ويشمل مجموعة كبيرة من
                                    التدريبات والمشاريع والألعاب الجميلة التي نقوم بإنشائها معًا من الصفر.
                                    أحيانًا نخلط بين الأشياء ونمنحك تطبيق مكسور ونطلب منك إصلاحه أو تحسين الكود.
                                    تحقق من الفيديو الترويجي لرؤية اثنين من التدريبات بالطبع. تتوج الدورة
                                    التدريبية بمشروع كابستون الضخم ، وهو أكبر مشروع قمت بإنشائه في أي دورة
                                    تدريبية على الإنترنت. أنا متحمس للغاية حيال ذلك.
                                </p>';
            $add->what_you_will_learn='<h4 class="mb-3">ما سوف تتعلم فى هذه الدورة</h4>

            <div class="row courseitems">
                                        <div class="col">
                                            <ul class="list-unstyled p-0">
                                                <li>التسويق الالكترونى</li>
                                                <li>صفحات ومجموعات الفيس بوك</li>
                                                <li>منصات تويتر ولينكد ان</li>

                                            </ul>
                                        </div>
                                        <div class="col">
                                            <ul class="list-unstyled p-0">
                                                <li>منصات سناب شات</li>
                                                <li>الاعلانات المدفوعة والمميزة</li>
                                                <li>الوصول للجمهور المستهدف</li>
                                            </ul>
                                        </div>
                                    </div>';
            $add->img='Courses/c4.jpg';
            $add->price=rand(1,10000);
            $add->registered_users_count=2;
            $add->lang='الفرنسية';
            $add->duration=15;
            $add->certificate=1;
            $add->save();







    }
}
