<?php

namespace Database\Seeders;

use Hash;
use App\Models\Setting;
use Illuminate\Database\Seeder;

class SettingTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
          /////////////// Setting  
            $add=new Setting;
            $add->name='مؤسسة الغد أجمل  ';
            $add->logo='Setting/logo.png';
            $add->logo_footer='Setting/logo-footer.png';
            $add->phone=' +966123456 ';
            $add->email=' info@learningek.com ';
            $add->address='الرياض . المملكة العربية السعودية';
            $add->facebook_link='https://www.facebook.com/';
            $add->twitter_link='https://www.twitter.com/';
            $add->linkedin_link='https://www.linkedin.com/';
            $add->copy_right='©'.date('Y').'All Rights Reserved';
            $add->about_title='مؤسسة الغد أجمل';
            $add->about_desc='لا شك أن الحصول على شهادة علمية أمر ضروري لجميع المهن المرتبطة بمجال الطب والصحة, وبالنسبة لمن يفكر في الدخول إلى هذا المجال بدون الحصول على درجة علمية، فهناك شهادات ,دبلومات ودورات قصيرة متوفرة هنا تساعدك كي تصبح مساعدًا طبيًا أو إداريًا. فيمكنك من تأسيس نفسك عن طريق هذه الدورات والشهادات ومن ثم دراسة شهادة علمية لاحقا او اذا كنت تملك شهادة علمية فيوجد ايضا دورات تطور مهاراتك وتكسبك خبرات جديدة مثل دورات العلاج الطبيعي ودورات الرياضة واللياقة البدنية وبرامج الإسعافات الأولية. كما ان ليمون يحتوي على قسم خاص بالوظائف في هذا المجال, يمكنك مشاهدة الوظائف في مجال الطب والصحة';
            $add->about_img='Setting/about.jpg';
            $add->What_Makes_Us_unique_title='ما يميزنا';
            $add->What_Makes_Us_unique_desc='لا شك أن الحصول على شهادة علمية أمر ضروري لجميع المهن المرتبطة بمجال الطب والصحة, وبالنسبة لمن يفكر في الدخول إلى هذا المجال بدون الحصول على درجة علمية، فهناك شهادات ,دبلومات ودورات قصيرة متوفرة هنا تساعدك كي تصبح مساعدًا طبيًا أو إداريًا. فيمكنك من تأسيس نفسك عن طريق هذه الدورات والشهادات ومن ثم دراسة شهادة علمية لاحقا او اذا كنت تملك شهادة علمية فيوجد ايضا دورات تطور مهاراتك وتكسبك خبرات جديدة مثل دورات العلاج الطبيعي ودورات الرياضة واللياقة البدنية وبرامج الإسعافات الأولية. كما ان ليمون يحتوي على قسم خاص بالوظائف في هذا المجال, يمكنك مشاهدة الوظائف في مجال الطب والصحة';
            $add->save();
    


    }
}
